
#Область ПрограммныйИнтерфейс 

// Интеграции с телеграм-ботом
//
Процедура ОтправитьСообщение() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка,
	|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения,
	|	ВКМ_ИдентификаторГруппыДляОповещения.Значение КАК ИдентификаторГруппы,
	|	ВКМ_ТокенУправленияТелеграмБотом.Значение КАК Токен
	|ИЗ
	|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту,
	|	Константа.ВКМ_ТокенУправленияТелеграмБотом КАК ВКМ_ТокенУправленияТелеграмБотом,
	|	Константа.ВКМ_ИдентификаторГруппыДляОповещения КАК ВКМ_ИдентификаторГруппыДляОповещения";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Сервер = "api.telegram.org";
		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
		
		Соединение = Новый HTTPСоединение(Сервер, , , , , , ЗащищенноеСоединение);
		
		АдресРесурса = СтрШаблон("/bot%1/sendMessage", ВыборкаДетальныеЗаписи.Токен);
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type", "application/json");
		
		Запрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
		
		Сообщения = Новый Структура;
		Сообщения.Вставить("chat_id", ВыборкаДетальныеЗаписи.ИдентификаторГруппы);
		Сообщения.Вставить("text", ВыборкаДетальныеЗаписи.ТекстСообщения);
		
		СтрокаJSON = ЗаписатьЗначениеJSON(Сообщения);
		
		Запрос.УстановитьТелоИзСтроки(СтрокаJSON);
		
		Попытка
			Ответ = Соединение.ОтправитьДляОбработки(Запрос);
			ТекстСообщенияОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
						
			Если Ответ.КодСостояния = 200 Тогда
				ЗаписьЖурналаРегистрации("Отправка успешна", УровеньЖурналаРегистрации.Примечание);
				ТекстСообщенияОбъект.Удалить();
			КонецЕсли;
			
		Исключение
			ЗаписьЖурналаРегистрации("Ошибка при отправке", УровеньЖурналаРегистрации.Ошибка, , 
			СтрШаблон("Код состояния: %1. %2", Ответ.КодСостояния, ОписаниеОшибки())); 	
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

