
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивДанных = ПолучитьИзВременногоХранилища(Объект.Адрес);
	
	ДиаграммаГанта.Очистить();
	
	Для Каждого ОтпускСотрудуника Из МассивДанных Цикл
		
		Точка = ДиаграммаГанта.УстановитьТочку(ОтпускСотрудуника.Сотрудник);
		Точка.Текст = ОтпускСотрудуника.Сотрудник;
		Серия = ДиаграммаГанта.УстановитьСерию(ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
		Серия.Текст = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск; 
		
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = ОтпускСотрудуника.ДатаНачала;   
		Интервал.Конец = ОтпускСотрудуника.ДатаОкончания; 
		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти