
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ++ Андреев Д.В. Дипломный проект 15.07.2025
	// Работа с заявками клиентов, договоры на абонентское обслуживание
	ПолеВвода = Элементы.Добавить("ВКМ_НачалоДействияДоговора", Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_НачалоДействияДоговора";
	ПолеВвода.Видимость = Ложь;
	
	ПолеВвода = Элементы.Добавить("ВКМ_ОкончаниеДействияДоговора", Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ОкончаниеДействияДоговора";
	ПолеВвода.Видимость = Ложь;
	ПолеВвода.УстановитьДействие("ПриИзменении", "ВКМ_ОкончаниеДействияДоговораПриИзменении");
	
	ПолеВвода = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	ПолеВвода.Видимость = Ложь;
	
	ПолеВвода = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	ПолеВвода.Видимость = Ложь; 
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		Элементы.ВКМ_НачалоДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_ОкончаниеДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
	КонецЕсли;
	// -- Андреев Д.В. Дипломный проект 15.07.2025
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	// ++ Андреев Д.В. Дипломный проект 15.07.2025
	// Работа с заявками клиентов, договоры на абонентское обслуживание
	Если Объект.ВидДоговора = 
		ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание") Тогда
		Элементы.ВКМ_НачалоДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_ОкончаниеДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
	Иначе
		Элементы.ВКМ_НачалоДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_ОкончаниеДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
	КонецЕсли;
	// -- Андреев Д.В. Дипломный проект 15.07.2025
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаКлиенте
Процедура ВКМ_ОкончаниеДействияДоговораПриИзменении()
	
	// ++ Андреев Д.В. Дипломный проект 15.07.2025
	// Работа с заявками клиентов, договоры на абонентское обслуживание
	ДатаОкончания = Объект.ВКМ_ОкончаниеДействияДоговора;
	Объект.ВКМ_ОкончаниеДействияДоговора = КонецДня(ДатаОкончания);
	// -- Андреев Д.В. Дипломный проект 15.07.2025
	
КонецПроцедуры

#КонецОбласти
